run/steady-fine/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.094;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet   { type fixedValue; value uniform 0.094; }
    outlet  { type zeroGradient; }
    ground  { type kqRWallFunction; value uniform 0.094; }
    top     { type slip; }
    sides   { type slip; }
    kitten  { type kqRWallFunction; value uniform 0.094; }
}


// ************************************************************************* //
